.export_from_1c/Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>send</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>done</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>fail</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

.export_from_1c/CommonModules/ШлюзЦентраУведомлений/Ext/Module.bsl
// Модуль ШлюзЦентраУведомлений

// Содержит основные функции для отправки сообщений в MessageCenter.
// Все экспортные функции предназначены для вызова из внешнего кода.
//
// @module ШлюзЦентраУведомлений
// @description Взаимодействие с сервером MessageCenter (WebSocket/HTTP шлюз)
// @see https://github.com/grevinden/msgw
//
// --------------------------------------------------------------------------------
// ТИПЫ КОЛЛЕКЦИЙ (СТРУКТУР) – описание по стандарту #std641
// --------------------------------------------------------------------------------
//
// 1. Пакет сообщения (создаётся функцией СоздатьПакет) – Структура:
//    * uuid   : УникальныйИдентификатор - уникальный ключ сообщения
//    * ttl    : Число - время жизни в секундах (0 допускается)
//    * payload: Структура - полезная нагрузка (см. п.2)
//
// 2. Полезная нагрузка (payload) в зависимости от типа сообщения:
//    Для send (ТипыСообщений.send):
//      ** typ : ПеречислениеСсылка.ТипыСообщений – значение send
//      ** top : Строка - тема уведомления
//      ** mes : Строка - текст уведомления
//    Для done (ТипыСообщений.done):
//      ** typ : ПеречислениеСсылка.ТипыСообщений – значение done
//    Для fail (ТипыСообщений.fail):
//      ** typ : ПеречислениеСсылка.ТипыСообщений – значение fail
//      ** err : Строка - описание ошибки
//
// 3. Ответ сервера (нормализованный) – ФиксированнаяСтруктура:
//    * uuid   : УникальныйИдентификатор (подтверждённый сервером)
//    * typ    : ПеречислениеСсылка.ТипыПакетовСообщений - notify / receipt / unknown
//    * ulid   : Строка (служебный идентификатор)
//    * payload: ФиксированнаяСтруктура - содержание ответа:
//        ** typ : ПеречислениеСсылка.ТипыСообщений - send / done / fail
//        ** может содержать top, mes, err в зависимости от typ
//
// --------------------------------------------------------------------------------
// ОСНОВНЫЕ ФУНКЦИИ
// --------------------------------------------------------------------------------

#Область ПрограммныйИнтерфейс

// Отправить уведомление (send)
// Отправляет обычное сообщение. Сообщение будет сохранено на сервере на указанное время жизни (TTL) и разослано всем подключённым клиентам.
//
// Параметры:
//   Идентификатор - УникальныйИдентификатор - Уникальный ключ сообщения (обязательный).
//   Тема          - Строка - Тема уведомления (поле top полезной нагрузки).
//   Текст         - Строка - Текст уведомления (поле mes полезной нагрузки).
//   ВремяЖизни    - Число - TTL в секундах. По умолчанию 0 (сервер установит значение по-умолчанию).
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Ответ сервера (см. п.3 описания типов).
//
// Пример:
//   Ид = Новый УникальныйИдентификатор;
//   Ответ = ШлюзЦентраУведомлений.ОтправитьУведомление(Ид, "Новости", "Вышла версия 2.0", 3600);
//
Функция ОтправитьУведомление(Идентификатор, Тема, Текст, ВремяЖизни = 0) Экспорт
	Пакет = СоздатьПакет(Перечисления.ТипыСообщений.send, Идентификатор, ВремяЖизни);
	Пакет.payload.top = Тема;
	Пакет.payload.mes = Текст;
	Возврат ОтправитьJSON(Пакет);
КонецФункции

// Отправить подтверждение (done)
// Отправляет квитанцию об успешной обработке. Подтверждение перезаписывает исходное сообщение с тем же идентификатором.
//
// Параметры:
//   Идентификатор - УникальныйИдентификатор - Уникальный ключ сообщения (обязательный).
//   ВремяЖизни    - Число (необязательный) - TTL в секундах для квитанции. По умолчанию 0.
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Ответ сервера (см. п.3 описания типов).
//
// Пример:
//   ШлюзЦентраУведомлений.ОтправитьПодтверждение(Ид);
//
Функция ОтправитьПодтверждение(Идентификатор, ВремяЖизни = 0) Экспорт
	Пакет = СоздатьПакет(Перечисления.ТипыСообщений.done, Идентификатор, ВремяЖизни);
	Возврат ОтправитьJSON(Пакет);
КонецФункции

// Отправить ошибку (fail)
// Отправляет квитанцию об ошибке. Используется для уведомления о невозможности обработать сообщение.
//
// Параметры:
//   Идентификатор    - УникальныйИдентификатор - Уникальный ключ сообщения (обязательный).
//   ОписаниеОшибки   - Строка - Текст ошибки (поле err полезной нагрузки).
//   ВремяЖизни       - Число (необязательный) - TTL в секундах для квитанции. По умолчанию 0.
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Ответ сервера (см. п.3 описания типов).
//
// Пример:
//   ШлюзЦентраУведомлений.ОтправитьОшибку(Ид, "Таймаут операции");
//
Функция ОтправитьОшибку(Идентификатор, ОписаниеОшибки, ВремяЖизни = 0) Экспорт
	Пакет = СоздатьПакет(Перечисления.ТипыСообщений.fail, Идентификатор, ВремяЖизни);
	Пакет.payload.err = ОписаниеОшибки;
	Возврат ОтправитьJSON(Пакет);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Преобразование значений при сериализации в JSON (вызывается автоматически).
// Не рекомендуется вызывать напрямую.
//
// Параметры:
//   Свойство               - Строка - Имя поля JSON.
//   Значение               - Произвольный - Значение поля.
//   ДополнительныеПараметры - Неопределено - Не используется.
//   Отказ                  - Булево (передача по ссылке) - При установке Истина поле исключается из JSON.
//
// Возвращаемое значение:
//   Произвольный - Значение, готовое к JSON-сериализации.
//
Функция ОбработчикПреобразованияJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Отказ = Истина;   // полностью исключить поле из JSON
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Возврат СериализаторXDTO.XMLСтрока(Значение);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("ПеречислениеСсылка.ТипыСообщений")
	   ИЛИ ТипЗнч(Значение) = Тип("ПеречислениеСсылка.ТипыПакетовСообщений") Тогда
		Возврат СериализаторXDTO.XMLСтрока(Значение);
	КонецЕсли;
	
	Возврат Значение;
КонецФункции

// Преобразует значения полей JSON при десериализации в типы 1С.
// Используется в качестве обработчика восстановления JSON (например, в КоннекторHTTP).
// Вызывается автоматически для каждого поля при чтении JSON.
//
// Параметры:
//   Свойство               - Строка - Имя поля JSON (например, "uuid" или "typ").
//   Значение               - Произвольный - Значение поля, полученное из JSON (обычно строка).
//   ДополнительныеПараметры - Неопределено - Не используется.
//
// Возвращаемое значение:
//   Произвольный - Преобразованное значение:
//     * Если Свойство = "uuid" – возвращается УникальныйИдентификатор, созданный из строки.
//     * Если Свойство = "typ" – возвращается значение перечисления:
//         - Перечисления.ТипыСообщений, если строка соответствует одному из его значений (send, done, fail).
//         - Перечисления.ТипыПакетовСообщений, если строка соответствует одному из его значений (notify, receipt, unknown).
//         - Иначе вызывается исключение "Перечисление тип [сообщения] пакета не найден".
//     * Для других полей возвращается исходное Значение (без изменений).
//
// Исключения:
//   ВызватьИсключение – если значение поля "typ" не найдено ни в одном из перечислений.
//
// Пример использования (автоматически):
//   // Параметры вызова КоннекторHTTP.ПрочитатьJson
//   ОбработчикВосстановленияJSON = ОбработчикВосстановленияJSON;
//   // при чтении JSON поля "uuid" и "typ" будут преобразованы в соответствующие типы.
//
Функция ОбработчикВосстановленияJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	Если Свойство = "uuid" Тогда
		Возврат Новый УникальныйИдентификатор(Значение);
	ИначеЕсли Свойство = "top" Тогда
		Тема = Справочники.ТемыУведомлений.НайтиПоКоду(Значение,Ложь);
		Если ЗначениеЗаполнено(Тема) Тогда
			Возврат Тема;
		Иначе
			ВызватьИсключение "Неудалось найти тему сообщения";
		КонецЕсли;
	ИначеЕсли Свойство = "typ" Тогда
		Если Не Метаданные.Перечисления.ТипыСообщений.ЗначенияПеречисления.Найти(Значение) = Неопределено Тогда
			Возврат Перечисления.ТипыСообщений[Значение];
		ИначеЕсли Не Метаданные.Перечисления.ТипыПакетовСообщений.ЗначенияПеречисления.Найти(Значение) = Неопределено Тогда
			Возврат Перечисления.ТипыПакетовСообщений[Значение];
		Иначе
			ВызватьИсключение "Перечисление тип [сообщения] пакета не найден";
		КонецЕсли;	
	КонецЕсли;
КонецФункции

// Настраивает параметры HTTP-запроса для КоннекторHTTP.
//
// Возвращаемое значение:
//   Структура - Параметры вызова КоннекторHTTP.PostJson().
//
Функция ПолучитьПараметрыHTTP(Json=Неопределено) Экспорт
	Параметры = КоннекторHTTP.НовыеПараметры();
	Параметры.Json = Json;
	Параметры.ПараметрыПреобразованияJSON.ПрочитатьВСоответствие = Ложь;
	Параметры.ПараметрыПреобразованияJSON.ИмяФункцииПреобразования = "ОбработчикПреобразованияJSON";
	Параметры.ПараметрыПреобразованияJSON.ИмяФункцииВосстановления = "ОбработчикВосстановленияJSON";
	Параметры.ПараметрыПреобразованияJSON.МодульФункцииВосстановления = ШлюзЦентраУведомлений;
	Параметры.ПараметрыПреобразованияJSON.МодульФункцииПреобразования = ШлюзЦентраУведомлений;
	Параметры.ПараметрыПреобразованияJSON.ИменаСвойствДляОбработкиВосстановления = СтрРазделить("uuid,typ,top",",",Ложь);
	Возврат Параметры;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, что значение принадлежит одному из допустимых типов.
// В случае несоответствия генерирует исключение.
//
// Параметры:
//   Значение       - Произвольный - Проверяемое значение.
//   ИмяПараметра   - Строка (необязательный) - Имя параметра для сообщения об ошибке.
//   Тип1, Тип2     - Тип - Ожидаемые типы (второй опциональный).
//
// Пример:
//   ТребоватьТип(Значение, "uuid", Тип("УникальныйИдентификатор"));
//
Процедура ТребоватьТип(Значение, ИмяПараметра = "", Тип1, Тип2 = Неопределено) Экспорт

	ТипЗначения = ТипЗнч(Значение);
	
	// Прямое совпадение с ожидаемыми типами
	Если ТипЗначения = Тип1 ИЛИ ТипЗначения = Тип2 Тогда
		Возврат;
	КонецЕсли;
	
	// Спецслучай: число 0 или 1 считается допустимым для Булево
	Если (Тип1 = Тип("Булево") ИЛИ Тип2 = Тип("Булево"))
	   И (Значение = 0 ИЛИ Значение = 1) Тогда
		Возврат;
	КонецЕсли;
	
	// Формирование сообщения об ошибке
	ОжидаемыеТипы = ?(Тип2 = Неопределено, Тип1, Тип1 + ", " + Тип2);
	Текст = ?(ЗначениеЗаполнено(ИмяПараметра), 
	           "Для параметра """ + ИмяПараметра + """ ", 
	           "") 
	        + "Получено значение типа """ + ТипЗначения 
			+ """ вместо ожидаемых типов: " + ОжидаемыеТипы;
	
	ВызватьИсключение Текст;

КонецПроцедуры    

// Создаёт структуру пакета сообщения (конструктор параметров).
// Возвращает нефиксированную структуру, соответствующую пакету.
//
// Параметры:
//   ТипСообщения     - ПеречислениеСсылка.ТипыСообщений - Тип сообщения (send, done, fail).
//   Идентификатор    - УникальныйИдентификатор - UUID сообщения.
//   ВремяЖизни       - Число - TTL в секундах. По умолчанию 0.
//
// Возвращаемое значение:
//   Структура - пакет сообщения (см. п.1 описания типов):
//     * uuid   : УникальныйИдентификатор
//     * ttl    : Число
//     * payload: Структура - содержание полезной нагрузки (см. п.2)
//
Функция СоздатьПакет(ТипСообщения, Идентификатор, ВремяЖизни = 0)
	ТребоватьТип(ТипСообщения, "payload.typ", Тип("ПеречислениеСсылка.ТипыСообщений"));
	ТребоватьТип(Идентификатор, "uuid", Тип("УникальныйИдентификатор"));
	ТребоватьТип(ВремяЖизни, "ttl", Тип("Число"));
	
	Если ТипСообщения = Перечисления.ТипыСообщений.send Тогда
		ПолезнаяНагрузка = Новый Структура("typ,top,mes", ТипСообщения, "", "");
	ИначеЕсли ТипСообщения = Перечисления.ТипыСообщений.fail Тогда
		ПолезнаяНагрузка = Новый Структура("typ,err", ТипСообщения, "");
	ИначеЕсли ТипСообщения = Перечисления.ТипыСообщений.done Тогда
		ПолезнаяНагрузка = Новый Структура("typ", ТипСообщения);
	Иначе
		ВызватьИсключение "Обработка типа не реализована";
	КонецЕсли;
		                                                                         
	Пакет = Новый Структура("uuid,ttl,payload", Идентификатор, Макс(ВремяЖизни,0), ПолезнаяНагрузка);
	
	Если Не ЗначениеЗаполнено(Пакет.ttl) Тогда
		Пакет.Удалить("ttl");
	КонецЕсли;
	
	Возврат Пакет;
КонецФункции

// Возвращает предопределённый элемент WebSocketКлиенты.ШлюзЦентраУведомлений.
//
// Возвращаемое значение:
//   ОпределенныйТип.ВебСокетКлиент - Объект настроек подключения.
//
Функция ПолучитьКлиент() Экспорт
	Возврат WebSocketКлиенты.НайтиПредопределенный(Метаданные.WebSocketКлиенты.ШлюзЦентраУведомлений);
КонецФункции

// Формирует базовый URL сервера из настроек клиента.
//
// Возвращаемое значение:
//   Строка - URL (например, "http://localhost:8000").
//
Функция ПолучитьБазовыйURL()
	Возврат ПолучитьКлиент().URLСервера;
КонецФункции

Функция СоединениеОткрыто() Экспорт
	Возврат ПолучитьКлиент().ПолучитьСостояниеСоединения() = СостояниеWebSocketСоединения.Открыто;
КонецФункции

Функция ПолучитьСоединение() Экспорт
	Возврат ПолучитьКлиент().ПолучитьТекущееСоединение();
КонецФункции

// Выполняет POST-запрос к серверу и нормализует ответ.
//
// Параметры:
//   Данные - Структура - Подготовленный пакет сообщения (содержит поля uuid, ttl, payload).
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Нормализованный ответ сервера (см. п.3 описания типов).
//
// Исключения:
//   Ошибка HTTP-запроса – при сбоях сети или некорректном ответе.
//
Функция ОтправитьJSON(Данные)
	
	ТребоватьТип(Данные, "Данные", Тип("Структура"));
	КН = КоннекторHTTP;
	
	Сессия = КН.СоздатьСессию();
	ДП = ПолучитьПараметрыHTTP(Данные);
	
	ПЗ = КН.ПодготовитьЗапрос(Сессия, "POST", ПолучитьБазовыйURL(), ДП);
	НП = КН.НастройкиПодключения(Сессия, ПЗ.Метод, ПЗ.URL, ДП);
	ПП = ДП.ПараметрыПреобразованияJSON;

	Если СоединениеОткрыто() Тогда
		ПолучитьСоединение().ОтправитьСообщение(ПЗ.HTTPЗапрос.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	Иначе	
		Попытка
			Ответ = КН.КакJson(КН.ОтправитьЗапрос(Сессия, ПЗ, НП), ПП);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение ("Ошибка HTTP-запроса: " 
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			, , , Данные, ИнформацияОбОшибке);
		КонецПопытки;
		Возврат ФиксированныйОтвет(Ответ);
	КонецЕсли;
КонецФункции

// Нормализует ответ сервера: преобразует uuid, typ, payload.typ, фиксирует структуры.
//
// Параметры:
//   Ответ - Структура - Ответ сервера (гарантированно структура) с полями:
//            * uuid   : Строка или УникальныйИдентификатор
//            * typ    : Строка
//            * payload: Структура с полем typ : Строка
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Нормализованный ответ (см. п.3 описания типов).
//
Функция ФиксированныйОтвет(Знач Ответ)
	Ответ.payload = Новый ФиксированнаяСтруктура(Ответ.payload);
	Возврат Новый ФиксированнаяСтруктура(Ответ);
КонецФункции

#КонецОбласти
